import ru.gb.jdk.two.online.bricks.MainWindow;

/**
 * В Java запрещено множественное наследние в отличии от С++. Проблему отсутствия множественного наследния частично
 * решают интерфейсы. Они определяют некоторый функционал, не имеющий конкретной реализации.
 * Интерфейс - это описание способов взаимодействия с объектом. Интерфейсы определяют функционал, не имеющий
 * конкретно реализации.
 */
public class Lecture002 {
    public static void main(String[] args) {
        new MainWindow();
    }
}
